RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_pxp.h
/*! @brief PXP fetch engine interface mode with the upstream store engine. */
typedef enum _pxp_fetch_interface_mode
{
    kPXP_FetchModeNormal    = 0U,
    kPXP_FetchModeHandshake = 0x1U,
    kPXP_FetchModeBypass    = 0x2U,
} pxp_fetch_interface_mode_t;

/*! @brief PXP fetch/store engine burst length for scanline mode. */
typedef enum _pxp_scanline_burst
{
    kPXP_Scanline8bytes,
    kPXP_Scanline16bytes,
    kPXP_Scanline32bytes,
    kPXP_Scanline64bytes,
} pxp_scanline_burst_t;

/*! @brief PXP fetch engine block configuration. */
typedef struct _pxp_block_format_config
{
    bool
        enableblock;  /*!< Enable to use block mode instead of scanline mode. Note: 1.Make sure to enable if rotate or
                         flip mode is enabled. 2.Block mode cannot work on 64bpp data stream where activeBits = 64. 3. If
                         LUT processing is in the path between the fetch and store engind, block mode must be enabled. */
    bool blockSize16; /*!< Enable to use 16*16 block, otherwise it will be 8*8 block. */
    pxp_scanline_burst_t burstLength; /*!< When using scanline mode, configure this for burst length. */
} pxp_block_config_t;

/*!
 * @brief PXP fetch/store engine input/output active bits configuration.
 *
 * Since fetch engine is 64-bit input and 32-bit output per channel, need to configure both channels to use 64-bit input
 * mode. And expand configuration will have no effect.
 */
typedef enum _pxp_activeBits
{
    kPXP_Active8Bits  = 0x0,
    kPXP_Active16Bits = 0x1,
    kPXP_Active32Bits = 0x2,
    kPXP_Active64Bits = 0x3,
} pxp_active_bits_t;

/*! @brief PXP fetch engine output word order when using 2 channels for 64-bit mode. */
typedef enum _pxp_fetch_output_word_order
{
    kPXP_FetchOutputChannel1channel0 = 0x0, /*!< In 64bit mode, channel 1 output high byte. */
    kPXP_FetchOutputChannel0channel1 = 0x1, /*!< In 64bit mode, channel 0 output high byte. */
} pxp_fetch_output_word_order_t;

/*!
 * @brief PXP fetch engine shift component configuration.
 *
 * Fetch engine can divded each word into 4 components and shift them.
 */
typedef struct _pxp_fetch_shift_component
{
    uint8_t offset;
    uint8_t width;
} pxp_fetch_shift_component_t;

/*!
 * @brief PXP fetch engine shift configuration.
 *
 * Fetch engine can divded each word into 4 components and shift them.
 * For example, to change YUV444 to YVU444, U and V positions need to be shifted: OFFSET0=8, OFFSET1=0, OFFSET2=16,
 * OFFSET3=24, WIDTH0/1/2/3=8
 */
typedef struct _pxp_fetch_shift_config
{
    bool shiftBypass; /* Bypass the shift */
    pxp_fetch_shift_component_t component0;
    pxp_fetch_shift_component_t component1;
    pxp_fetch_shift_component_t component2;
    pxp_fetch_shift_component_t component3;
} pxp_fetch_shift_config_t;

/*! @brief PXP fetch engine input pixel format. */
typedef enum _pxp_fetch_pixel_format
{
    kPXP_FetchFormatRGB565     = 0x0,
    kPXP_FetchFormatRGB555     = 0x1,
    kPXP_FetchFormatARGB1555   = 0x2,
    kPXP_FetchFormatRGB444     = 0x3,
    kPXP_FetchFormatARGB4444   = 0x4,
    kPXP_FetchFormatYUYVorYVYU = 0x5,
    kPXP_FetchFormatUYVYorVYUY = 0x6,
    kPXP_FetchFormatYUV422_2P  = 0x7,
} pxp_fetch_pixel_format_t;

/*! @brief PXP fetch engine configuration for one of the channel. */
typedef struct _pxp_fetch_engine_config
{
    bool channelEnable; /*!< Enable channel. */
    /* Address configuration */
    uint32_t inputBaseAddr0; /*!< The input base address. Used for Y plane input when pixel format is YUV422_2p. */
    uint32_t inputBaseAddr1; /*!< Must configure this for UV plane when input pixel format is YUV422_2p. */
    /* Size configuration */
    uint16_t totalHeight; /*!< Total height for the actual fetch size. */
    uint16_t totalWidth;  /*!< Total width for the actual fetch size. */
    uint16_t pitchBytes;  /*!< Channel input pitch */
    uint16_t
        ulcX; /*!< X coordinate of upper left coordinate in pixels of the active surface of the total input memory */
    uint16_t
        ulcY; /*!< Y coordinate of upper left coordinate in pixels of the active surface of the total input memory */
    uint16_t
        lrcX; /*!< X coordinate of Lower right coordinate in pixels of the active surface of the total input memory */
    uint16_t
        lrcY; /*!< Y coordinate of Lower right coordinate in pixels of the active surface of the total input memory */
    /* Interface configuration */
    pxp_fetch_interface_mode_t interface; /*!< Interface mode, normal/bypass/handshake */
    /* Pixel configuration */
    pxp_active_bits_t activeBits;         /*!< Input active bits. */
    pxp_fetch_pixel_format_t pixelFormat; /*!< Input pixel fetch format */
    bool expandEnable; /*!< If enabled, input pixel will be expanded to ARGB8888, RGB888 or YUV444 of 32-bit format at
                          the output. */
    /* Fetch format configuration */
    pxp_flip_mode_t flipMode;         /*!< Flip the fetched input. */
    pxp_rotate_degree_t rotateDegree; /*!< Rotate the fetched input. */
    pxp_block_config_t
        fetchFormat; /*!< Block mode configuration. Make sure to enable block if rotate or flip mode is enabled. */
    /* Output configuration. */
    pxp_fetch_shift_config_t shiftConfig;    /*!< Shift operation configuration. */
    pxp_fetch_output_word_order_t wordOrder; /*!< Output word order when using 2 channels for 64-bit mode. */
} pxp_fetch_engine_config_t;

/* Store engine configuration. */

/*!
 * @brief PXP store engine enumeration
 *
 * There are actually 4 store engine implemented, the others are WFE-A store engine and WFE-B store engine,
 * whose registers are reserved from developer.
 */
typedef enum _pxp_store_engine_name
{
    kPXP_StoreInput,
    kPXP_StoreDither,
} pxp_store_engine_name_t;

/*! @brief PXP store engine interface mode with the downstream fetch engine. */
typedef enum _pxp_store_interface_mode
{
    kPXP_StoreModeBypass    = 0x20U,
    kPXP_StoreModeNormal    = 0x40U,
    kPXP_StoreModeHandshake = 0x43U,
    kPXP_StoreModeDual      = 0x60U, /*!< Store engine outputs data directly to downstream fetch engine(Bypass) but also
                                        storing it to memory at the same time. */
} pxp_store_interface_mode_t;

/*! @brief PXP store engine YUV output mode. */
typedef enum _pxp_store_yuv_mode
{
    kPXP_StoreYUVDisable = 0U, /*!< Do not output YUV pixel format. */
    kPXP_StoreYUVPlane1 =
        0x1U, /*!< Use channel to output YUV422_1p pixel format, need to use shift operation to make sure each pixel
                 component in its proper position: 64-bits of pixel data format and each 32 bits as {Y0, U0, Y1, V0}. */
    kPXP_StoreYUVPlane2 =
        0x2U, /*!< Use channel to output YUV422_2p pixel format, need to use shift operation to make sure each pixel
                 component in its proper position: channel 0 {Y0,Y1}, channel 1 {U0,V0}. */
} pxp_store_yuv_mode_t;

/*! @brief Shift configuration for PXP store engine. */
typedef struct _pxp_store_shift_config
{
    /* Data/Flag shift */
    bool shiftBypass;         /*!< Bypass the data shift */
    uint64_t *pDataShiftMask; /*!< Pointer to mask0~mask7 to mask the 64-bit of output data, data is masked first then
                                 shifted according to width. */
    uint8_t *pDataShiftWidth; /*!< Pointer to width0~width7. Bit 7 is for shifted direction, 0 to right. Bit0~5 is for
                                 shift width. */
    uint8_t *pFlagShiftMask;  /*!< Pointer to mask0~mask7 to mask the 8-bit of output flag, flag is masked first then
                                 shifted according to width. */
    uint8_t *pFlagShiftWidth; /*!< Pointer to width0~width7. Bit 6 is for shifted direction, 0 to right. Bit0~5 is for
                                 shift width. */
} pxp_store_shift_config_t;

/*! @brief PXP store engine configuration for one of the channel. */
typedef struct _pxp_store_engine_config
{
    bool channelEnable; /*!< Enable channel. */
    /* Address configuration */
    uint32_t outputBaseAddr0; /*!< The channel 0 output address if using 2 channels. If using 1 channel(must be channel
                                 0) and YUV422_2p output format, is for Y plane address. */
    uint32_t outputBaseAddr1; /*!< The channel 1 output address if using 2 channels. If using 1 channel(must be channel
                                 0) and YUV422_2p output format, is for UV plane address. */
    /* Size configuration */
    uint16_t totalHeight; /*!< Total height for the actual store size. */
    uint16_t totalWidth;  /*!< Total width for the actual store size. */
    uint16_t pitchBytes;  /*!< Channel input pitch */
    /* Interface configuration */
    pxp_store_interface_mode_t interface; /*!< Interface mode, normal/bypass/handshake/dual. Make sure 2 channels use
                                               the same mode if both enabled. */
    /* pxp_store_handshake_array_t arraySize; !< If interfase mode is handshake, need to configure the array size. When
                                              block is disabled, the scanline can only be 1. TODO no need now. */
    /* Pixel configuration */
    pxp_active_bits_t activeBits; /*!< Output active bits. */
    pxp_store_yuv_mode_t yuvMode; /*!< Whether to output YUV pixel format. */
    /* Fixed data configuration, only apply for channel 0. */
    bool useFixedData; /*!< Whether to use fixed value for the output data. Can be used to write fixed value to specific
                          memory location for memory initialization. */
    uint32_t fixedData; /*!< The value of the fixed data. */
    /* Data packing */
    bool packInSelect; /*!< When enabled, channel 0 will select low 32 bit shift out data to pack while channel i select
                          high 32 bit, otherwise all 64bit of data will be selected. */
    /* Data store format */
    pxp_block_config_t storeFormat;       /*!< The format to store data, block or otherwise. */
    pxp_store_shift_config_t shiftConfig; /*!< Shift operation configuration. */
} pxp_store_engine_config_t;

/* Pre-dither CFA engine configuration */

/*! @brief PXP pre-dither CFA engine input pixel format. */
typedef enum _pxp_cfa_input_format
{
    kPXP_CfaRGB888,
    kPXP_CfaRGB444,
} pxp_cfa_input_format_t;

/*! @brief PXP pre-dither CFA engine configuration. */
typedef struct _pxp_cfa_config
{
    bool bypass;                          /*!< Bypass the CFA process */
    pxp_cfa_input_format_t pixelInFormat; /*!< The pixel input format for CFA. */
    uint8_t arrayWidth;                   /*!< CFA array vertical size in pixels, min 3 max 15. */
    uint8_t arrayHeight;                  /*!< CFA array horizontal size in pixels, min 3 max 15. */
    uint16_t totalHeight; /*!< Total height for the buffer size, make sure it is aligned with the dither fetch engine
                             and dither engine. */
    uint16_t totalWidth;  /*!< Total width for the buffer size, make sure it is aligned with the dither fetch engine and
                             dither engine. */
    uint32_t *cfaValue; /*!< Pointer to the value for the CFA array. 2-bit per component: 00-R,01-G,10-B,11-W. For a 4x4
                           array, 32 bits are need. */
} pxp_cfa_config_t;

/* Histogram configuration and status */

/*! @brief PXP histogram mask condition. */
typedef enum _pxp_histogram_mask_condition
{
    kPXP_HistogramMaskEqual    = 0x0U, /*!< Value that equal to value0 will pass the mask operation. */
    kPXP_HistogramMaskNotequal = 0x1U, /*!< Value that not equal to value0 will pass the mask operation. */
    kPXP_HistogramMaskIn  = 0x2U, /*!< Value that within the range of value0-value1 will pass the mask operation. */
    kPXP_HistogramMaskOut = 0x3U, /*!< Value that without the range of value0-value1 will pass the mask operation. */
} pxp_histogram_mask_condition_t;

/*! @brief PXP Histogram configuration. */
typedef struct _pxp_histogram_config
{
    bool enable;            /*!< Enable histogram process. */
    uint8_t *pParamValue;   /*!< Pointer to the 62(2+4+8+16+32) byte of param value for 2-level, 4-level.....32-level
                               parameters. Only low 5-bit of each byte is valid. */
    uint8_t lutValueOffset; /*!< The starting bit position of the LUT value. */
    uint8_t lutValueWidth;  /*!< The bit width of the LUT value, should be no more than 6 bits since only 63 LUTs are
                               supported. */
    /* Mask configuration */
    bool enableMask;    /*!< Enable mask operation. */
    uint8_t maskValue0; /*!< Value 0 for the condition judgement. */
    uint8_t maskValue1; /*!< Value 1 for the condition judgement. */
    uint8_t maskOffset; /*!< The starting bit position of the field to be checked against mask condition. */
    uint8_t maskWidth;  /*!< The width of the field to be checked against mask condition. */
    pxp_histogram_mask_condition_t condition; /*!< The mask condition. */
    /* Size configuration */
    uint16_t totalHeight; /*!< Total height for the buffer size, make sure it is aligned with the output of legacy flow
                             or the WFE-A/B engine. */
    uint16_t totalWidth; /*!< Total width for the buffer size, make sure it is aligned with the output of legacy flow or
                            the WFE-A/B engine. */
} pxp_histogram_config_t;

